import pandas as pd

data = {
    'набор А' : [85, 90, 95, 100, 105],
    'набор Б' : [70, 80, 95, 110, 120]
}
df=pd.DataFrame(data)
stdA = df['набор А'].std()
stdB = df['набор Б'].std()
print(f'Стандартное отклонение обоих наборов: {stdA}, {stdB}')


df1=pd.DataFrame({
    'возраст' : [23, 22, 21, 27, 23, 20, 29, 28, 22, 25],
    'зарплата' : [54000, 58000, 60000, 52000, 55000, 59000, 51000, 49000, 53000, 61000]
})
print(df1.describe())
print(f'Средний возраст - {df1['возраст'].mean()}')
print(f'Медианный возраст - {df1['возраст'].median()}')
print(f'Стандартное отклонение возраста - {df1['возраст'].std()}')
print(f'Средняя ЗП - {df1['зарплата'].mean()}')
print(f'Медианная ЗП - {df1['зарплата'].median()}')
print(f'Стандартное отклонение ЗП - {df1['зарплата'].std()}')



